turbq/atprog/packs/atmel/SAM3S_DFP/1.0.70/sam3s/atdf/ATSAM3S1A.atdf
        <register caption="Channel Status Register" name="ADC_CHSR" offset="0x18" rw="R" size="4">
          <bitfield caption="Channel 0 Status" mask="0x00000001" name="CH0"/>
          <bitfield caption="Channel 1 Status" mask="0x00000002" name="CH1"/>
          <bitfield caption="Channel 2 Status" mask="0x00000004" name="CH2"/>
          <bitfield caption="Channel 3 Status" mask="0x00000008" name="CH3"/>
          <bitfield caption="Channel 4 Status" mask="0x00000010" name="CH4"/>
          <bitfield caption="Channel 5 Status" mask="0x00000020" name="CH5"/>
          <bitfield caption="Channel 6 Status" mask="0x00000040" name="CH6"/>
          <bitfield caption="Channel 7 Status" mask="0x00000080" name="CH7"/>
          <bitfield caption="Channel 8 Status" mask="0x00000100" name="CH8"/>
          <bitfield caption="Channel 9 Status" mask="0x00000200" name="CH9"/>
          <bitfield caption="Channel 10 Status" mask="0x00000400" name="CH10"/>
          <bitfield caption="Channel 11 Status" mask="0x00000800" name="CH11"/>
          <bitfield caption="Channel 12 Status" mask="0x00001000" name="CH12"/>
          <bitfield caption="Channel 13 Status" mask="0x00002000" name="CH13"/>
          <bitfield caption="Channel 14 Status" mask="0x00004000" name="CH14"/>
          <bitfield caption="Channel 15 Status" mask="0x00008000" name="CH15"/>
        </register>
        <register caption="Last Converted Data Register" name="ADC_LCDR" offset="0x20" rw="R" size="4">
          <bitfield caption="Last Data Converted" mask="0x00000FFF" name="LDATA"/>
          <bitfield caption="Channel Number" mask="0x0000F000" name="CHNB"/>
        </register>
        <register caption="Interrupt Enable Register" name="ADC_IER" offset="0x24" rw="W" size="4">
          <bitfield caption="End of Conversion Interrupt Enable 0" mask="0x00000001" name="EOC0"/>
          <bitfield caption="End of Conversion Interrupt Enable 1" mask="0x00000002" name="EOC1"/>
          <bitfield caption="End of Conversion Interrupt Enable 2" mask="0x00000004" name="EOC2"/>
          <bitfield caption="End of Conversion Interrupt Enable 3" mask="0x00000008" name="EOC3"/>
          <bitfield caption="End of Conversion Interrupt Enable 4" mask="0x00000010" name="EOC4"/>
          <bitfield caption="End of Conversion Interrupt Enable 5" mask="0x00000020" name="EOC5"/>
          <bitfield caption="End of Conversion Interrupt Enable 6" mask="0x00000040" name="EOC6"/>
          <bitfield caption="End of Conversion Interrupt Enable 7" mask="0x00000080" name="EOC7"/>
          <bitfield caption="End of Conversion Interrupt Enable 8" mask="0x00000100" name="EOC8"/>
          <bitfield caption="End of Conversion Interrupt Enable 9" mask="0x00000200" name="EOC9"/>
          <bitfield caption="End of Conversion Interrupt Enable 10" mask="0x00000400" name="EOC10"/>
          <bitfield caption="End of Conversion Interrupt Enable 11" mask="0x00000800" name="EOC11"/>
          <bitfield caption="End of Conversion Interrupt Enable 12" mask="0x00001000" name="EOC12"/>
          <bitfield caption="End of Conversion Interrupt Enable 13" mask="0x00002000" name="EOC13"/>
          <bitfield caption="End of Conversion Interrupt Enable 14" mask="0x00004000" name="EOC14"/>
          <bitfield caption="End of Conversion Interrupt Enable 15" mask="0x00008000" name="EOC15"/>
          <bitfield caption="Data Ready Interrupt Enable" mask="0x01000000" name="DRDY"/>
          <bitfield caption="General Overrun Error Interrupt Enable" mask="0x02000000" name="GOVRE"/>
          <bitfield caption="Comparison Event Interrupt Enable" mask="0x04000000" name="COMPE"/>
          <bitfield caption="End of Receive Buffer Interrupt Enable" mask="0x08000000" name="ENDRX"/>
          <bitfield caption="Receive Buffer Full Interrupt Enable" mask="0x10000000" name="RXBUFF"/>
        </register>
        <register caption="Interrupt Disable Register" name="ADC_IDR" offset="0x28" rw="W" size="4">
          <bitfield caption="End of Conversion Interrupt Disable 0" mask="0x00000001" name="EOC0"/>
          <bitfield caption="End of Conversion Interrupt Disable 1" mask="0x00000002" name="EOC1"/>
          <bitfield caption="End of Conversion Interrupt Disable 2" mask="0x00000004" name="EOC2"/>
          <bitfield caption="End of Conversion Interrupt Disable 3" mask="0x00000008" name="EOC3"/>
          <bitfield caption="End of Conversion Interrupt Disable 4" mask="0x00000010" name="EOC4"/>
          <bitfield caption="End of Conversion Interrupt Disable 5" mask="0x00000020" name="EOC5"/>
          <bitfield caption="End of Conversion Interrupt Disable 6" mask="0x00000040" name="EOC6"/>
          <bitfield caption="End of Conversion Interrupt Disable 7" mask="0x00000080" name="EOC7"/>
          <bitfield caption="End of Conversion Interrupt Disable 8" mask="0x00000100" name="EOC8"/>
          <bitfield caption="End of Conversion Interrupt Disable 9" mask="0x00000200" name="EOC9"/>
          <bitfield caption="End of Conversion Interrupt Disable 10" mask="0x00000400" name="EOC10"/>
          <bitfield caption="End of Conversion Interrupt Disable 11" mask="0x00000800" name="EOC11"/>
          <bitfield caption="End of Conversion Interrupt Disable 12" mask="0x00001000" name="EOC12"/>
          <bitfield caption="End of Conversion Interrupt Disable 13" mask="0x00002000" name="EOC13"/>
          <bitfield caption="End of Conversion Interrupt Disable 14" mask="0x00004000" name="EOC14"/>
          <bitfield caption="End of Conversion Interrupt Disable 15" mask="0x00008000" name="EOC15"/>
          <bitfield caption="Data Ready Interrupt Disable" mask="0x01000000" name="DRDY"/>
          <bitfield caption="General Overrun Error Interrupt Disable" mask="0x02000000" name="GOVRE"/>
          <bitfield caption="Comparison Event Interrupt Disable" mask="0x04000000" name="COMPE"/>
          <bitfield caption="End of Receive Buffer Interrupt Disable" mask="0x08000000" name="ENDRX"/>
          <bitfield caption="Receive Buffer Full Interrupt Disable" mask="0x10000000" name="RXBUFF"/>
        </register>
